module.exports = {
  插件名: "画师算命插件", //插件名，仅在插件加载时展示
  指令: "^/画师算命$", //指令触发关键词，可使用正则表达式匹配
  版本: "1.0", //插件版本，仅在插件加载时展示
  作者: "Giftina", //插件作者，仅在插件加载时展示
  描述: "avg模板，由一段段随机语料拼凑成一段文案，可以写简单的随机小说", //插件说明，仅在插件加载时展示

  execute: async function (msg, userId, userName, groupId, groupName, options) {
    const 画风 = [
      "厚涂",
      "美式",
      "韩风",
      "迪士尼风格",
      "日系赛璐璐",
      "日系平涂",
      "国风",
    ];
    const 喜爱画的类型 = [
      "机械",
      "大腿",
      "美少年",
      "美少女",
      "奶子",
      "兄贵",
      "屁股",
      "脸蛋",
      "大屌",
      "给佬",
      "幼女",
      "JK",
      "黑丝",
      "胖次",
      "白丝",
      "小手",
      "【不可描述】",
      "裸足",
      "蕾丝",
    ];
    const 生活经历 = [
      "有了一些同好",
      "被人骗稿多次",
      "找不到工作",
      "只能做外包",
      "出了很多本子",
      "被人骗炮",
      "做了自由职业者",
      "当了某大项目主美",
      "经常被抄袭",
      "在某站成名",
      "每天混吃等死",
    ];
    const 画画发生的事情 = [
      "被请喝茶",
      "被人寄刀片",
      "被举报",
      "本子卖到爆炸",
      "被人吐槽",
      "被人骗炮",
      "突然爆红",
      "被人抄袭",
      "在街角被蜀黍强暴",
    ];
    const 最后的故事 = [
      "因为画得不行转而卖艺，竟然变成了偶像",
      "做了一辈子社畜",
      "名垂青史但是变成了时代眼泪",
      "也没有出人头地，转行做了别的行业",
      "赚够了钱去了幻想乡",
      "因为断连载被愤怒的读者高呼飞出地球",
      "舒舒服服退休回老家结婚",
      "一直活跃在最前线，活到老画到老",
      "成为了魔法少女",
    ];

    if (!userName) userName = "你";
    const 随机画风 =
      画风[Math.floor(Math.random() * 画风.length)];
    const 随机喜爱画的类型 =
      喜爱画的类型[Math.floor(Math.random() * 喜爱画的类型.length)];
    const 随机生活经历 =
      生活经历[Math.floor(Math.random() * 生活经历.length)];
    const 随机画画发生的事情 =
      画画发生的事情[Math.floor(Math.random() * 画画发生的事情.length)];
    const 随机粉丝数 = Math.floor(Math.random() * (100000 - 1) + 1);
    const 随机生涯年龄 = Math.floor(Math.random() * (100 - 1) + 1);
    const 随机最后的故事 =
      最后的故事[Math.floor(Math.random() * 最后的故事.length)];

    const 算命 = `${userName}是一名${随机画风}画师，最喜欢画${随机喜爱画的类型}，而且${随机生活经历}，然而因为画得太过和谐而${随机画画发生的事情}，还因为这件事在微博上有了${随机粉丝数}个粉丝，做了${随机生涯年龄}年画师，最后${随机最后的故事}。`;

    return { type: "text", content: 算命 };
  },
};
